# Categories Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Categories Members
Categories Class Methods Properties See Also
---
The Categories type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every category from the map, rendering it empty. (Inherited from CategoryNameMap.) |
| Contains | Identifies if a category which has the specified name is in the list of top-level categories. (Overrides CategoryNameMap..::..Contains(String).) |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Erase | Removes a category with the specified name from the map. (Inherited from CategoryNameMap.) |
| ForwardIterator | Retrieves a forward moving iterator to the map. (Overrides CategoryNameMap..::..ForwardIterator()()()().) |
| GetEnumerator | Retrieves a forward moving iterator to the map. (Overrides CategoryNameMap..::..GetEnumerator()()()().) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Insert | Inserts the specified category with the specified name into the map. (Overrides CategoryNameMap..::..Insert(String, Category).) |
| NewSubcategory | Add a new subcategory into the Autodesk Revit document. |
| ReverseIterator | Retrieves a backward moving iterator to the map. (Overrides CategoryNameMap..::..ReverseIterator()()()().) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Whether or not the list of top-level categories is empty. (Overrides CategoryNameMap..::..IsEmpty.) |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| [Item[([( String])]) ](9e2a96fc-df10-2e33-e042-53360cc9724e.md "Item Property \(String\)") | Gets a category which has the specified name from this list of top-level categories. (Overrides [CategoryNameMap..::..Item[([( String])]) ](5c189fd7-6881-976e-5ab1-ffd349c67ef3.md "Item Property").) |
| [Item[([( BuiltInCategory])]) ](562ddcba-8f15-7421-e7a5-6968ccef7b10.md "Item Property \(BuiltInCategory\)") | Retrieves a category object corresponding to a BuiltInCategory id. |
| Size | The total number of top-level categories in the document. (Overrides CategoryNameMap..::..Size.) |

# See Also
Categories Class
Autodesk.Revit.DB Namespace